#include <linux/kernel.h>
#include <linux/module.h>
#include <linux/platform_device.h>
#include <linux/slab.h>
#include <linux/mutex.h>
#include <linux/string.h>
#include <linux/power_supply.h>
#include <linux/mfd/88pm860x.h>
#include <linux/delay.h>
#include <linux/rtc.h>
#include <linux/of.h>
#include <linux/mod_devicetable.h>
#include <linux/qpnp/qpnp-adc.h>
#include <linux/workqueue.h>
#include <asm/delay.h>
#include <linux/kobject.h>
#include <linux/sysfs.h>
#include "battery_core.h"
#include "charger_core.h"

//#define pr_fmt(fmt) "%s: " fmt, __func__
umode_t battery_attr_is_visible(struct kobject *kobj,struct attribute *attr, int attrno);
ssize_t battery_show_property(struct device *dev,struct  device_attribute *attr, char* buf);
ssize_t battery_store_property(struct device *dev,struct device_attribute *attr, const char* buf, size_t count);


//*****************************************************
//*  Таблица соответствия напряжения и уровня заряда
//*****************************************************

struct capacity {
  int percent;
  int vmin;
  int vmax;
  int offset;
  int hysteresis;
};
  
// 
struct capacity battery_capacity_table[12]= {
//  %       vmin     vmax   offset hysteresis
   {0,      3100,    3597,    0,    10},
   {1,      3598,    3672,    0,    10},
   {10,     3673,    3735,    0,    10},
   {20,     3736,    3757,    0,    10},
   {30,     3758,    3788,    0,    10},
   {40,     3789,    3832,    0,    10},
   {50,     3833,    3909,    0,    10},
   {60,     3910,    3988,    0,    10},
   {70,     3989,    4072,    0,    10},
   {80,     4073,    4156,    0,    10},
   {90,     4157,    4200,    0,    10},
   {100,    4201,    4500,    0,    10}
};   
#define battery_capacity_table_size 12




//*****************************************************
//*  Таблица перевода напряжения в температуру
//*****************************************************
struct ntc_tvm {
   int tntc;
   int tnvc;
};

struct ntc_tvm ntc_tvm_tables[] = {
// температура  напряжение
     {-45,      1800000},         
     {-40,      1693138},
     {-35,      1665952},
     {-30,      1633668},
     {-25,      1595877},
     {-20,      1551873},
     {-15,      1501569},
     {-10,      1444173},
     {-5,       1379919},
     {0,        1308687},
     {5,        1231323},
     {10,       1149570},
     {15,       1065303},
     {20,       979678},
     {25,       895000},
     {30,       812338},
     {35,       733267},
     {40,       658735},
     {45,       589543},
     {50,       525875},
     {55,       467795},
     {60,       415297},
     {65,       368123},
     {70,       326146},
     {75,       288699},
     {80,       255758},
     {85,       226817},
     {90,       201430},
     {95,       179128},
     {100,      159466},
     {105,      142204},
     {110,      127049},
     {115,      113656},
     {120,      101957},
     {125,      91546}
};    

#define ntc_table_size 35

//*****************************************************
//*   Таблица sysfs-атрибутов
//*****************************************************


static DEVICE_ATTR(capacity,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(ntc,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(precharge_voltage,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(poweroff_voltage,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(low_voltage,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(recharge_voltage,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(charge_done_votage,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(temp_low_poweroff,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(temp_low_disable_charge,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(temp_high_disable_charge,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(temp_high_poweroff,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(temp_error_margin,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(charging_monitor_period,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(discharging_monitor_period,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(vbat_max,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(ibat_max,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(test_mode,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(disable_charging,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(high_voltage,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(capacity_changed_margin,0,battery_show_property, battery_store_property);  
static DEVICE_ATTR(debug_mode,0,battery_show_property, battery_store_property);  

static struct attribute* battery_attrs[]={
  &dev_attr_capacity.attr,
  &dev_attr_ntc.attr,
  &dev_attr_precharge_voltage.attr,
  &dev_attr_poweroff_voltage.attr,
  &dev_attr_low_voltage.attr,
  &dev_attr_recharge_voltage.attr,
  &dev_attr_charge_done_votage.attr,
  &dev_attr_temp_low_poweroff.attr,
  &dev_attr_temp_low_disable_charge.attr,
  &dev_attr_temp_high_disable_charge.attr,
  &dev_attr_temp_high_poweroff.attr,
  &dev_attr_temp_error_margin.attr,
  &dev_attr_charging_monitor_period.attr,
  &dev_attr_discharging_monitor_period.attr,
  &dev_attr_vbat_max.attr,
  &dev_attr_ibat_max.attr,
  &dev_attr_test_mode.attr,
  &dev_attr_disable_charging.attr,
  &dev_attr_high_voltage.attr,
  &dev_attr_capacity_changed_margin.attr,
  &dev_attr_debug_mode.attr,
  0
};
/*
static struct device_attribute battery_attrs[21]={
 {{"capacity", 0},                   &battery_show_property, &battery_store_property},
 {{"ntc", 0},                        battery_show_property, battery_store_property},
 {{"precharge_voltage", 0},          battery_show_property, battery_store_property},
 {{"poweroff_voltage", 0},           battery_show_property, battery_store_property},
 {{"low_voltage", 0},                battery_show_property, battery_store_property},
 {{"recharge_voltage", 0},           battery_show_property, battery_store_property},
 {{"charge_done_votage", 0},         battery_show_property, battery_store_property},
 {{"temp_low_poweroff", 0},          battery_show_property, battery_store_property},
 {{"temp_low_disable_charge", 0},    battery_show_property, battery_store_property},
 {{"temp_high_disable_charge", 0},   battery_show_property, battery_store_property},
 {{"temp_high_poweroff", 0},         battery_show_property, battery_store_property},
 {{"temp_error_margin", 0},          battery_show_property, battery_store_property},
 {{"charging_monitor_period", 0},    battery_show_property, battery_store_property},
 {{"discharging_monitor_period", 0}, battery_show_property, battery_store_property},
 {{"vbat_max", 0},                   battery_show_property, battery_store_property},
 {{"ibat_max", 0},                   battery_show_property, battery_store_property},
 {{"test_mode", 0},                  battery_show_property, battery_store_property},
 {{"disable_charging", 0},           battery_show_property, battery_store_property},
 {{"high_voltage", 0},               battery_show_property, battery_store_property},
 {{"capacity_changed_margin", 0},    battery_show_property, battery_store_property},
 {{"debug_mode", 0},                 battery_show_property, battery_store_property}
};
*/

static struct attribute_group battery_attr_group={
  "parameters", 
  battery_attr_is_visible, 
  battery_attrs
}; 

//*****************************************************
//*  Главная интерфейсная структура
//*****************************************************

// 592 байта
struct battery_core_interface {
   struct battery_interface* api;   // 0
   struct charger_core_interface * charger; // 4
   struct device* dev;  // 8
   struct mutex lock; //12, 40 байт
   int x52;
   struct wakeup_source ws;  // 56, размер 152   
   struct power_supply psy;  // 208, размер 148

   struct workqueue_struct * mon_queue; // 316

 //---------------------------------  
   struct delayed_work work;     // 320, размер  76:  320-386
   // work_strict work
   //             atomic_long_t data;      320
   //             struct list_head entry;  324-328

   //void (*battery_core_monitor_work)(work_struct *); //332
   struct timer_list timer; //336, размер 52: 336-392

   // void (*function)(unsigned int); //352
//-----------------------------------
//   struct delayed_work* pwork; // 356
   
   int x392;
   int chg_mon_period; // 396
   int dischg_mon_period;
   int new_status; // 404
   int x408;
   char* bname;  //412
   int status;        //416
   int current_now;   //420
   int current_max;   //424
   int volt_now;      //428
   int volt_avg;      //432
   int volt_max;      //436
   int capacity;      //440
   int x444;        
   int x448;
   int present;       //452
   int temp;          //456
   int health;        //460
   int debug_mode;
   int test_mode;
   int disable_chg;
   int cap_changed_margin;
   int prechare_volt;  //480
   int x484;
   int poweroff_volt;  //488
   int low_volt;  //492
   int high_voltage;
   int recharge_volt;    // 500
   int charge_done_volt; //504
   int temp_low_poweroff;   // 508
   int temp_low_disable_charge;   // 512
   int x516;
   int x520;
   int temp_high_disable_charge; //524
   int temp_high_poweroff;    //528
   int temp_error_margin;   //532
   
   int vref;              // 536
   int vref_calib;        // 540
   struct ntc_tvm* ntc;  // 544
   int ntcsize;          // 548
   struct capacity* cap; //552
   int capsize;  //556	
   int x560;
   int x564;
   int x568;
   int x572;
   int x576;
   int x580;
   int x584;
   int x588;
};   

//*****************************************************
//*  Таблица параметров батарейки
//*****************************************************
static enum power_supply_property battery_core_power_props[] = {
  POWER_SUPPLY_PROP_STATUS, 
  POWER_SUPPLY_PROP_PRESENT, 
  POWER_SUPPLY_PROP_TEMP, 
  POWER_SUPPLY_PROP_HEALTH, 
  POWER_SUPPLY_PROP_VOLTAGE_NOW, 
  POWER_SUPPLY_PROP_VOLTAGE_AVG,
  POWER_SUPPLY_PROP_CAPACITY, 
  POWER_SUPPLY_PROP_VOLTAGE_MAX, 
  POWER_SUPPLY_PROP_CURRENT_MAX, 
  POWER_SUPPLY_PROP_CURRENT_NOW
};  

//*****************************************************
//*  Проверка доступности записи уазанного параметра
//*****************************************************
int battery_core_property_is_writeable(struct power_supply *psy,enum power_supply_property psp) {
  
if ((psp ==  POWER_SUPPLY_PROP_PRESENT) || 
